#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hashidemos/hashicat-aws-gitops/runs/run-ckp4jFYPHUxfQJBj

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.hashicat: Refreshing state... [id=32ce28fea342a949229e2963f226e6325c4a881e]
aws_key_pair.hashicat: Refreshing state... [id=assareh-workshop-api-ssh-key.pem]
aws_vpc.hashicat: Refreshing state... [id=vpc-07cdd6dca1584388d]
aws_internet_gateway.hashicat: Refreshing state... [id=igw-006d683cde61b82b3]
aws_subnet.hashicat: Refreshing state... [id=subnet-076a685c374931626]
aws_security_group.hashicat: Refreshing state... [id=sg-0eff6562955ad5d89]
aws_route_table.hashicat: Refreshing state... [id=rtb-0dbdd722029c0d370]
aws_instance.hashicat[0]: Refreshing state... [id=i-007baaf5e7031b88e]
aws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-04f0bd9ff566401ea]
aws_eip.hashicat[0]: Refreshing state... [id=eipalloc-05bea5d7ef0488926]
aws_eip_association.hashicat[0]: Refreshing state... [id=eipassoc-01d8c258b309d277f]
null_resource.configure-cat-app[0]: Refreshing state... [id=4002325075792936899]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.hashicat[0] has changed
  ~ resource "aws_eip" "hashicat" {
        id                   = "eipalloc-05bea5d7ef0488926"
      + tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.hashicat[0] has changed
  ~ resource "aws_instance" "hashicat" {
        id                                   = "i-007baaf5e7031b88e"
      ~ public_dns                           = "ec2-54-193-131-151.us-west-1.compute.amazonaws.com" -> "ec2-54-193-191-161.us-west-1.compute.amazonaws.com"
      ~ public_ip                            = "54.193.131.151" -> "54.193.191.161"
        tags                                 = {
            "Name" = "assareh-workshop-api-hashicat-instance"
        }
        # (27 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_key_pair.hashicat has changed
  ~ resource "aws_key_pair" "hashicat" {
        id          = "assareh-workshop-api-ssh-key.pem"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.hashicat has changed
  ~ resource "aws_route_table" "hashicat" {
        id               = "rtb-0dbdd722029c0d370"
      + tags             = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.hashicat[1] will be created
  + resource "aws_eip" "hashicat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip_association.hashicat[1] will be created
  + resource "aws_eip_association" "hashicat" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.hashicat[1] will be created
  + resource "aws_instance" "hashicat" {
      + ami                                  = "ami-019b05d9246b5d240"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "assareh-workshop-api-ssh-key.pem"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-076a685c374931626"
      + tags                                 = {
          + "Name" = "assareh-workshop-api-hashicat-instance"
        }
      + tags_all                             = {
          + "Name" = "assareh-workshop-api-hashicat-instance"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0eff6562955ad5d89",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # null_resource.configure-cat-app[0] must be replaced
-/+ resource "null_resource" "configure-cat-app" {
      ~ id       = "4002325075792936899" -> (known after apply)
      ~ triggers = {
          - "build_number" = "2022-02-09T21:10:40Z"
        } -> (known after apply) # forces replacement
    }

  # null_resource.configure-cat-app[1] will be created
  + resource "null_resource" "configure-cat-app" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ catapp_url = [
        "ec2-54-193-191-161.us-west-1.compute.amazonaws.com",
      + (known after apply),
    ]

------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 5 estimated
           $13.43359999999999968/mo +$6.3168

------------------------------------------------------------------------

Organization policy check:

===================== Results for policy set: sentinel-demo ====================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

6 policies evaluated.

## Policy 1: sentinel-demo/limit-cost-and-percentage-increase (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  both the total monthly cost and the percentage increase in  the monthly cost that would be incurred if the current plan  were applied

Print messages:

Proposed percentage increase 88.758993 is under the max percentage change: 100.000000

./limit-cost-and-percentage-increase.sentinel:21:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 2: sentinel-demo/validate-variables-have-descriptions (advisory)

Result: true

Description:
  This policy uses the tfconfig/v2 import to validate that all variables  have descriptions

./validate-variables-have-descriptions.sentinel:24:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 3: sentinel-demo/restrict-s3-bucket-policies (hard-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 and tfconfig/v2 imports to require  that all S3 bucket policies are implemented with the aws_iam_policy_document  data source and that those policies require buckets to only be accessible  via HTTPS and from specific VPC endpoints.

./restrict-s3-bucket-policies.sentinel:161:1 - Rule "main"
  Value:
    true

## Policy 4: sentinel-demo/enforce-mandatory-tags (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to require that  specified Azure resources have all mandatory tags

./enforce-mandatory-tags.sentinel:36:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 5: sentinel-demo/restrict-vm-size (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to require that  all Azure VMs have vm sizes from an allowed list

./restrict-vm-size.sentinel:41:1 - Rule "main"
  Value:
    true

## Policy 6: sentinel-demo/restrict-app-service-to-https (hard-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfplan/v2 import to require that  all Azure app services have https_only set to true so that  they can only be accessed via HTTPS

./restrict-app-service-to-https.sentinel:18:1 - Rule "main"
  Description:
    Main rule

  Value:
    true



```

</details>

*Pusher: @assareh, Action: `pull_request`*